app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R'))  ORDER BY release_date
---
  def index
    @all_ratings = Movie.ratings

    @movies = Movie.order(params[:sort])